package com.gmail.mekhanich.andrii;

import java.util.Scanner;

public class Main {

	public static void main(String[] args) {
		// Написать программу, которая считывает 5 значное число с клавиатуры и выводит
		// цифры из которого оно состоит в столбец

		// Объявляем переменную, где будем хранить число пользователя. Число
		// целочисленное - потому int
		int num;

		// Запрос числа у пользователя (для этого импортируем метод считывания)
		System.out.println("Input your 5 digits number and press Enter:");
		Scanner scan = new Scanner(System.in);

		num = scan.nextInt();

		// Объявляем переменную, для первой цифры числа
		int Dig1;
		Dig1 = num / 10000; // рассчет = деление без остатка всего числа на 10 000. Результат (из примера и
							// для примера) 5

		// Объявляем переменную, для второй цифры числа
		int Dig2;
		Dig2 = num % 10000 / 1000; // рассчет = остаток от деления на 10 000 всего числа (результат 4321) и деления
									// его без остатка на 1 000 Результат (4)

		// Объявляем переменную, для третей цифры числа
		int Dig3;
		Dig3 = num % 10000 % 1000 / 100; // рассчет = остаток от деления всего числа (результат 4321) и остаток деления
											// результата (321) делим без остатка на 100 результат 3

		// Объявляем переменную, для четвертой цифры числа
		int Dig4;
		Dig4 = num % 10000 % 1000 % 100 / 10; // рассчет = остаток от деления всего числа (результат 4321) и остаток
												// деления результата (321) делим с остатком на 100 результат 21, его
												// делим без остатка на 10

		// Объявляем переменную, для пятой цифры числа
		int Dig5;
		Dig5 = num % 10000 % 1000 % 100 % 10; // рассчет = остаток от деления всего числа (результат 4321) и остаток
												// деления результата (321) делим с остатком на 100 результат 21, его
												// делим с остатком на 10

		// Вывод результата на экран
		System.out.println(Dig1);
		System.out.println(Dig2);
		System.out.println(Dig3);
		System.out.println(Dig4);
		System.out.println(Dig5);
	}

}
